Autodesk.Revit.DB.ExternalService.SingleServerService.UnsetActiveServer(Autodesk.Revit.DB.Document)
Unset the active server for the particular document.
Remarks:
After unsetting the active server, the document will be using the
application-wide active server, if one was already set.
Note it is not possible to unset a server that acts as an application-wide
active server for a service. On the other hand, there should be no reason
to ever do so, for each and every registered service should have (ideally)
an active server set applicatiton-wide.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The operation is not allowed because the service is being executed.
Since:
2013

Autodesk.Revit.DB.ExternalService.SingleServerService.SetActiveServer(System.Guid,Autodesk.Revit.DB.Document)
Change the active server for a specific document.
Remarks:
Only one server per document can be set as active at any given time
in a single-server service. A document does not have to have an explicitly
set active server though - the application-wide active server would be
normally used when the service is executed for such a document.
Having an active server for a document overrules the active server
set for the application. That means if the service gets executed in
this particular document, the document-specific server will be used
instead of the application-wide one.
It is possible to set a server as active when another server is already active
for that service in this document. Making a server active will automatically
deactivate the server that was active before this call.
serverId:
Id of the server.
document:
The document for which the server is being set as active.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given Id is not of a server registered with the service.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The operation is not allowed because the service is being executed.
Since:
2013